Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.memo-ecs-service will be created
+ resource "aws_ecs_service" "memo-ecs-service" {
      + cluster                            = "arn:aws:ecs:ap-northeast-2:264842458097:cluster/memo-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "memo-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-2:264842458097:task-definition/memo-ecs-task-definition:6"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "memo-ecs-container"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-06f64f1a2a42dfc63",
            ]
          + subnets          = [
              + "subnet-0b8de44bcd332b5ac",
              + "subnet-0bb6102ac68f7e016",
            ]
        }
    }

  # aws_lb_listener.memo-alb-listener will be updated in-place
~ resource "aws_lb_listener" "memo-alb-listener" {
        id                = "arn:aws:elasticloadbalancing:ap-northeast-2:264842458097:listener/app/memo-alb/99c5d5623fa5aa5f/6d34e868e2d2e54e"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:264842458097:targetgroup/memo-alb-target-group/2718b0985718ba5f" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.memo-alb-target-group must be replaced
+/- resource "aws_lb_target_group" "memo-alb-target-group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:264842458097:targetgroup/memo-alb-target-group/2718b0985718ba5f" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/memo-alb-target-group/2718b0985718ba5f" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:264842458097:targetgroup/memo-alb-target-group/2718b0985718ba5f" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "memo-alb-target-group"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ target_type                        = "instance" -> "ip" # forces replacement
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ interval            = 30 -> 300
          ~ timeout             = 5 -> 60
          ~ unhealthy_threshold = 2 -> 5
            # (6 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
